app/Controllers/Facts.php

SELECT *
FROM `facts`
---
    public function backEnd (){
        /* Instancia modelo de la tabla Facts */
        $facts_model = model(FactsModel::class);

        // Nos da todas las filas en formato array de la tabla Facts
        $data["facts"] = $facts_model->findAll();