app/Controllers/Facts.php

SELECT *
FROM `facts`
JOIN `7wonders` ON `7wonders`.`id`=`facts`.`wonder_id`
---
    public function index (){

        // Controlamos si hay sessión o no para entrar en parte Admin
        $session = session();
        if(empty($session->get('user'))){
            return redirect()->to(base_url('admin/loginForm'));
        }

        /* Instancia modelo de la tabla Facts */
        $facts_model = model(FactsModel::class);


        /* Instancia modelo Wonders para el Join */
        $wonder_model = model(WondersModel::class);

        // Es necesario hacer un join para tener el nombre de la maravilla
        $data = [
            'facts' => $facts_model->join('7wonders', '7wonders.id=facts.wonder_id')->findAll(),
            'titulo' => "Manage Facts",
        ];

INSERT INTO `facts` (`fact_text`, `wonder_id`) VALUES ('PetraGaleche', '7')
---
    public function create(){

        helper('form');

        $data = $this->request->getPost(['fact_text', 'wonder_id']);

        if(!$this->validateData($data, [
            'fact_text' => 'required|max_length[255]|min_length[3]',
            'wonder_id' => 'required',
        ])) {
            // Si no es cierto vuelve a ejecutar la función create()
            return $this->create();
        }

        $post = $this->validator->getValidated();
        $facts_model = model(FactsModel::class);

        $facts_model->save([
            'fact_text' => $post['fact_text'],
            'wonder_id' => $post['wonder_id'],
        ]);

SELECT *
FROM `facts`
WHERE `fact_id` = '1'
 LIMIT 1
---
    public function updateForm($id){

        // Controlamos si hay sessión o no para crear una Fact nueva
        $session = session();
        if(empty($session->get('user'))){
            return redirect()->to(base_url('admin/loginForm'));
        }

        helper('form');

        //Para rellenar el desplegable
        $wonder_model = model(WondersModel::class);
        $data['wonders'] = $wonder_model->findAll(); // Todas las wonders para el select

        //Para rellenar campos del formulario de fact a modificar
        $facts_model = model(FactsModel::class);
        $data['fact'] = $facts_model->where(['fact_id' => $id])->first(); //Encontrar el FACT que corresponde al ID pasado en la función