app/Controllers/Wonders.php

SELECT *
FROM `facts`
WHERE `wonder_id` = '1'
---
    public function show($location,$id_wonder) {

        /* Instancias tablas */
        $wonders_model = model(WondersModel::class);
        $facts_model = model(FactsModel::class);

        // Obtener las maravillas para los botones
        $data["wonders"] = $wonders_model->findAll();

        // Obtener maravilla $id_wonder
        $data["wonder_selected"] = $wonders_model->where(['id' => $id_wonder])->first();

        // Obtener los Facts de la maravilla segun $id_wonder
        $data['wonder_facts'] = $facts_model->where(['wonder_id'=> $id_wonder])->find();