app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `username` = 'admin1234'
 LIMIT 1
---
    public function checkUser($user, $pass) {

        // Busca solo por username
        $user = $this->where('username', $user)->first();